
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ГрафикОтпусков Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаОсновныеНачисления.ДатаКонца);
		Движение.ПериодРегистрации = Дата;
		Движение.ПлановыйОтпуск = (НачалоДня(ТекСтрокаОсновныеНачисления.ДатаКонца) - НачалоДня(ТекСтрокаОсновныеНачисления.ДатаНачала)) / (60 * 60 * 24);
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		  
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат) КАК Результат,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихЧасов) КАК РабочихЧасов,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.ОтработаноЧасов) КАК ОтработаноЧасов
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|ГДЕ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета
		|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &Начало И &Конец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
		
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Начало", ДобавитьМесяц(Дата,-12));
	Запрос.УстановитьПараметр("Конец", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий()Тогда
	Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("Сотрудник",Запись.Сотрудник));                                                   
		Запись.Результат = (Выборка.Результат/(Выборка.ОтработаноЧасов/8))*(Выборка.РабочихЧасов/8 - Выборка.ОтработаноЧасов/8);  
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
    КонецЕсли;

	
	
КонецПроцедуры
