
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ФормированияДвжений();
	
	РасчетНачисленийПоОтпуску();
	
	ДвиженияПоНакопительномуРегиструОтпусков();
	
	
КонецПроцедуры

#КонецОбласти 
#Область СлужебныеПроцедурыИФункции

Процедура ФормированияДвжений()
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	МассивРаботающихСотрудниковЗаПериод = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета
	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &Начало И &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
	
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Начало", ДобавитьМесяц(Дата,-12));
	Запрос.УстановитьПараметр("Конец", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивРаботающихСотрудниковЗаПериод.Добавить(Выборка.Сотрудник);	
	КонецЦикла;
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ГрафикОтпусков Цикл
		Если МассивРаботающихСотрудниковЗаПериод.Найти(ТекСтрокаОсновныеНачисления.Сотрудник)<> Неопределено Тогда
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
			Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаКонца;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;	
		Иначе 
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сотрудник %1 не работал за прошлый год",ТекСтрокаОсновныеНачисления.Сотрудник));
		КонецЕсли;
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура РасчетНачисленийПоОтпуску()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат), 0) КАК Результат,
	|	ЕСТЬNULL(СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочихЧасов), 0) КАК РабочихЧасов,
	|	ЕСТЬNULL(СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.ОтработаноЧасов), 0) КАК ОтработаноЧасов
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета
	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &Начало И &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
	
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Начало", ДобавитьМесяц(Дата,-12));
	Запрос.УстановитьПараметр("Конец", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий()Цикл
		Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления  Цикл
			Результат = (Выборка.Результат/(Выборка.ОтработаноЧасов/8))*((Запись.ПериодДействияКонец - Запись.ПериодДействияНачало)/ 86400);
			Выборка.Сбросить();
			Выборка.НайтиСледующий(Новый Структура ("Сотрудник",Запись.Сотрудник));                                                   
			Запись.Результат = Результат; 
		КонецЦикла;
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
КонецПроцедуры

Процедура ДвиженияПоНакопительномуРегиструОтпусков()
	Движения.ВКМ_ДвиженияПоОтпускам.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
	Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("Сотрудник",Запись.Сотрудник));
	    Движение = Движения.ВКМ_ДвиженияПоОтпускам.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Регистратор = Запись.Регистратор;
		Движение.Сотрудник = Запись.Сотрудник;
		Движение.ОтпускДней = Выборка.ЗначениеФактическийПериодДействия/8;
		КонецЦикла;
	КонецЦикла;
	
	Движения.ВКМ_ДвиженияПоОтпускам.Записать();

КонецПроцедуры;

#КонецОбласти




