
Функция PingGetPing(Запрос)
	Возврат ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPOSTSend(Запрос)
	
	
	
	УстановитьПривилегированныйРежим(Истина); 
	
	СтрокаОшибки = Запрос.ПолучитьТелоКакСтроку();	
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Попытка
		Ответ = ВКМ_ТелеграммПолучение.ОбработкаВходящихЗапросов(Запрос);  
	Исключение 
		Ошибка = ИнформацияОбОшибке(); 
		Ответ = ВКМ_ОбщегоНазначенияHTTP.ОбработатьИнформациюОбОшибкеWebСервиса(СтрокаОшибки,Ошибка,,"ТелеграмБот","Send запрос");
	КонецПопытки;		
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bot.send",НачалоЗамера);
	ВКМ_ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос,Ответ);
	
	Возврат Ответ; 

КонецФункции
