
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками Приход
	Если Выплаты.Количество() > 0 Тогда
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из ВыплатыПлановые Цикл
		    Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
			Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	Выплаты.Очистить();
	ВыплатыПлановые.Очистить();
	КонецЕсли;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
