

#Область ПрограммныйИнтерфейс

Функция ОбработкаОтправленныхЗапросов(ТектСообщения)Экспорт 
	
	ПараметрыПодключения = ПараметрыПодключения();
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппы.Получить();	
	
	//создайте защищённое соединение с сервером "api.telegram.org"
	Соединение = НовоеСоединение(ПараметрыПодключения);	
	
	//подготовьте структуру с полями:
	//"chat_id" - идентификатор группы из константы,
	//"text" - текст сообщения
	ПараметрыЗапроса = ПараметрыЗапроса(ТектСообщения,ИдентификаторЧата);
	
	//установите JSON строку, полученную из структуры, в качестве тела HTTP-запроса
	ТелоЗапроса = ВКМ_ОбщегоНазначенияHTTP.СтрокаJSON(ПараметрыЗапроса);
	
	//добавьте заголовок "Content-Type" со значением "application/json"
	Заголовки = ЗаголовкиДляЗапроса(); 
	
	АдресРесурса = ПараметрыПодключения.АдресБезСервера;
	//создайте HTTP-запрос к ресурсу /bot[ВашТокен]/sendMessage
	Попытка
		Запрос = Новый HTTPЗапрос(АдресРесурса,Заголовки);
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		//отправьте запрос с помощью метода "POST"
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		//проверьте, что получет ответ с кодом состояния 200, 
		//если код состояния отличный от 200, 
		//получите тело ответа как строку 
		//и запишите в журнал регистрации информацию об ошибке.
		Если Ответ.КодСостояния <> 200 Тогда
			СтрокаОшибки = Ответ.ПолучитьТелоКакСтроку(); 
			Ошибка = ИнформацияОбОшибке();
			ВКМ_ОбщегоНазначенияHTTP.ОбработатьИнформациюОбОшибкеWebСервиса(СтрокаОшибки,Ошибка,,"TelegramApi","POST-Запрос");
		КонецЕсли;
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключения() 
	
	//Защищенный протокол//Адрес сервера//Токен/Метод
	// https://api.telegram.org/bot[ВашТокен]/sendMessage
	
	Результат = Новый Структура;
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБота.Получить();
	АдрессПолностью = СтрШаблон("//api.telegram.org/bot%1/sendMessage",Токен); 
	АдресБезСервера = СтрШаблон("/bot%1/sendMessage",Токен);
	
	Результат.Вставить("ЗащищённоеСоединение",Новый ЗащищенноеСоединениеOpenSSL);
	Результат.Вставить("АдресСервера", "api.telegram.org");
	Результат.Вставить("АдрессПолностью",АдрессПолностью);
	Результат.Вставить("АдресБезСервера",АдресБезСервера);
	
	Возврат Результат;
	
КонецФункции

Функция НовоеСоединение(ПараметрыПодключения)
	Возврат Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,,,,,
	ПараметрыПодключения.ЗащищённоеСоединение);	
КонецФункции

Функция ЗаголовкиДляЗапроса()
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type",ВКМ_ОбщегоНазначенияHTTP.ТипКонтентаJSON());	
	Возврат Заголовки;
КонецФункции 

Функция ПараметрыЗапроса(Text,ChatID)
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("text", Text);
	ПараметрыЗапроса.Вставить("chat_id", Формат(ChatID, "ЧГ=0"));	
	Возврат ПараметрыЗапроса;
КонецФункции

#КонецОбласти





