
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресОтпусковДокумента = Параметры.АдресДиаграммВХранилище;
	ГрафикОтпусковТЧ = ПолучитьИзВременногоХранилища(АдресОтпусковДокумента);
	ЗаполнениеДГ(ДГ,ГрафикОтпусковТЧ);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнениеДГ(Диаграмма,ТЧ)
	Серия = Диаграмма.УстановитьСерию("Отпуска");
	Для Каждого Строка Из ТЧ Цикл
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия); 
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаКонца;
	КонецЦикла;
КонецПроцедуры 
#КонецОбласти


