#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПредыдущийИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Специалист");
	ПредыдущаяДата        = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Дата");
	ДополнительныеСвойства.Вставить("ПредыдущийИсполнитель",ПредыдущийИсполнитель);
	ДополнительныеСвойства.Вставить("ПредыдущаяДата",ПредыдущаяДата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ЗначениеЗаполнено(ДатаПроведенияРабот) Тогда
		Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание  
			Или Договор.ВКМ_НачалоДействия > ДатаПроведенияРабот 
			Или Договор.ВКМ_КонецДействия < ДатаПроведенияРабот Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Договор не является абоненстким обслуживанием или даты проведения работ не входят в рамки действия договора'");
			Сообщение.Сообщить();
		Иначе 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ЗаполненностьРеквизита КАК ЗаполненностьРеквизита
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
			|ГДЕ
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
			
			Запрос.УстановитьПараметр("Сотрудник", Специалист);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.ЗаполненностьРеквизита Тогда
					Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
					Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить(); 
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = ДатаПроведенияРабот;
					Движение.Сотрудник = Специалист;
					Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов"); 
					Если ВыборкаДетальныеЗаписи.ПроцентОтРабот <> 0 Тогда
						Движение.СуммаКОплате = Движение.ЧасовКОплате *Договор.ВКМ_СтоимостьЧасаРаботы *ВыборкаДетальныеЗаписи.ПроцентОтРабот/100;
					КонецЕсли;
				Иначе 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ru='Специалисту не установлен процент'");
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЦикла;
			// регистр ВКМ_ВыполненныеКлиентуРаботы Приход
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			КоличествоЧасов = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
			Часы = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиента");
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить(); 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПроведенияРабот;
			Движение.Клиент = Договор.Организация;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = КоличествоЧасов;
			Движение.СуммаКОплате = КоличествоЧасов * Договор.ВКМ_СтоимостьЧасаРаботы ;
			
		КонецЕсли;
	Иначе 
		ОбщегоНазначения.СообщитьПользователю("Не заполнена дата проведения работ"); 
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//При записи документа Обслуживание клиента, 
	//если документ записывается первый раз или если дата, 
	//время или специалист изменились, добавьте в справочник сообщение с текстом, описывающим изменения.
	НовыйДокумент = ДополнительныеСвойства.ЭтоНовый;	
	Если НовыйДокумент <> Неопределено Тогда
		Значение = СравнениеДатыИСпециалиста(Дата,ДополнительныеСвойства.ПредыдущаяДата,Специалист,ДополнительныеСвойства.ПредыдущийИсполнитель);
		Если НовыйДокумент Или Значение <> Неопределено Тогда 
			Если НовыйДокумент Тогда
				Значение = СтрШаблон("%1 %2",Дата,Специалист);
			КонецЕсли;
			СпрОбъект = Справочники.ВКМ_УведомленияТелеграммБота.СоздатьЭлемент();
			СпрОбъект.ТекстСообщения = СтрШаблон("По заказу №%1 изменились данные: %2",
			ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер),Значение);  
			СпрОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция СравнениеДатыИСпециалиста(НоваяДата,СтараяДата,НовыйСпециалист,СтарыйСпециалист)
	МассивЗначений = Новый Массив;
	Если СтараяДата <> НоваяДата Тогда
		МассивЗначений.Добавить(НоваяДата);
	КонецЕсли; 
	Если СтарыйСпециалист<> НовыйСпециалист Тогда
		МассивЗначений.Добавить(НовыйСпециалист);	
	КонецЕсли;
	Если МассивЗначений.Количество()>0 Тогда
		Возврат СтрСоединить(МассивЗначений," ");
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции 

#КонецОбласти

