
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)Экспорт
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ЗаказПокупателя.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение()Экспорт
	
	НовыйМассив = Новый Массив;
	
	АбонПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	ВидАбонПлаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АбонПлата,"ВидНоменклатуры");
	
	РабСпец   = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	ВидРабСпец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабСпец,"ВидНоменклатуры");

	Если НЕ ЗначениеЗаполнено(АбонПлата) Или НЕ ЗначениеЗаполнено(РабСпец) Тогда
		Если Не ЗначениеЗаполнено(АбонПлата)Тогда 
			НовыйМассив.Добавить("Номенклатура абонентская плата");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(РабСпец) Тогда 
			НовыйМассив.Добавить("Номенклатура работа специалиста");
		КонецЕсли;   
		ШаблонСообщения = СтрШаблон("Не заполненно значение констант: %1", СтрСоединить(НовыйМассив," "));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ШаблонСообщения);
		Возврат;
	КонецЕсли;
	Товары.Очистить();
	Услуги.Очистить();
	СуммаАбонетскойПлаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВКМ_СуммаАбонентскойПлаты");
	Если СуммаАбонетскойПлаты <> 0 Тогда 
		Если ВидАбонПлаты = Перечисления.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонПлата;
			НоваяСтрока.Сумма = СуммаАбонетскойПлаты;
		ИначеЕсли ВидАбонПлаты = Перечисления.ВидыНоменклатуры.Товар Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = АбонПлата;
			НоваяСтрока.Сумма = СуммаАбонетскойПлаты;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
				|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасовОборот,
				|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот
				|ИЗ
				|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&Начало, &Конец, Месяц, Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Конец", КонецДня(КонецМесяца(Дата)));
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВидРабСпец = Перечисления.ВидыНоменклатуры.Услуга Тогда
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = РабСпец; 
			НоваяСтрока.Количество = -ВыборкаДетальныеЗаписи.КоличествоЧасовОборот;
			НоваяСтрока.Сумма = -ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;
		ИначеЕсли ВидРабСпец = Перечисления.ВидыНоменклатуры.Товар Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = РабСпец;
			НоваяСтрока.Количество = -ВыборкаДетальныеЗаписи.КоличествоЧасовОборот;
			НоваяСтрока.Сумма = -ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт 
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Договор");
	ПроверяемыеРеквизиты.Добавить("Контрагент");	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
