 #Область ПрограммныйИнтерфейс
 
 Процедура ВКМ_ОтправкаУведомлений() Экспорт
	 
	 УстановитьПривилегированныйРежим(Истина);
	 Выборка = Справочники.ВКМ_УведомленияТелеграммБота.Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Ответ = ВКМ_ТелеграммОтправка.ОбработкаОтправленныхЗапросов(Выборка.ТекстСообщения);
		 Если Ответ = 200 Тогда
			 ОбъектСправочника = Выборка.ПолучитьОбъект();
			 ОбъектСправочника.Удалить();	
		 КонецЕсли;
	 КонецЦикла;
	 УстановитьПривилегированныйРежим(Ложь);
	 
 КонецПроцедуры
 
 #КонецОбласти