
#Область ПрограммныйИнтерфейс

Функция СозданиеРеализации(ДатаНачала,ДатаКонца)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	// 1. Получаем все договоры на период
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_ДатаСозданияДокумента КАК ВКМ_ДатаСозданияДокумента,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаСозданияДокумента МЕЖДУ &ДатаНачала И &ДатаКонца";
	
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца" ,ДатаКонца);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДоговоров = Новый Массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДоговоров.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.Договор.Ссылка КАК Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.Ссылка В(&МассивДоговоров)";
	
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	// 3. Создаём хэш-таблицу (ключ — договор, значение — реализация)
	ХэшТаблицаРеализаций = Новый Массив; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Запись = Новый Структура;
		Запись.Вставить("Договор",ВыборкаДетальныеЗаписи.Договор);
		Запись.Вставить("Реализация",ВыборкаДетальныеЗаписи.Реализация);
		ХэшТаблицаРеализаций.Добавить(Запись);
	КонецЦикла;  
	
	// 4. Создаём недостающие реализации
	Сч = 0; 
	Записанные = 0;
	Проведенные = 0;
	КоличествоДоговоров = МассивДоговоров.Количество();
	Для Каждого Договор Из МассивДоговоров Цикл
		Сч = Сч+1;
		Найдено = Ложь;
		Для Каждого Запись Из ХэшТаблицаРеализаций Цикл
			Если Запись.Договор = Договор Тогда
				Найдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не Найдено Тогда
			// Создаем новую реализацию
			НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НоваяРеализация.Дата = ТекущаяДатаСеанса();
			НоваяРеализация.Договор = Договор;
			НоваяРеализация.Контрагент = Договор.Владелец;
			НоваяРеализация.Организация = Договор.Организация;
			НоваяРеализация.Записать();
			СсылкаРеал = НоваяРеализация.Ссылка;
			НоваяРеализация.ОбработкаЗаполнения(СсылкаРеал,,Истина);
			НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение();
			РезультатПроверки = СтандартныйМеханизмПроверкиЗаполнения(Договор);
			Если РезультатПроверки Тогда
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				Проведенные = Проведенные + 1;
			Иначе 
				Записанные = Записанные + 1;
			КонецЕсли;
			
			//Создаем запись в регистре записей
			МенеджерЗаписи = РегистрыСведений.ВКМ_АвтоматическиЗаполненныеДокументы.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Договор = Договор; 
			МенеджерЗаписи.Реализация = СсылкаРеал;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		ДлительныеОперации.СообщитьПрогресс(Сч /КоличествоДоговоров *100);	
	КонецЦикла; 
		
	СтрокаСообщения = СтрШаблон("Всего создано реализаций: %1%2Проведено:%3%4Записано:%5"
												,Проведенные+Записанные,Символы.ПС,Проведенные,Символы.ПС,Записанные);
    Возврат СтрокаСообщения;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция СтандартныйМеханизмПроверкиЗаполнения(Договор)
	Если Договор.Владелец <> Неопределено И Договор.Организация <> Неопределено Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти 


