
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ГрафикОтпусковПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаКонца) Тогда
		Если Элемент.ТекущиеДанные.ДатаКонца > Элемент.ТекущиеДанные.ДатаНачала Тогда
			Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сотрудник) Тогда
				ЗаполнениеРезультатаДат(Элемент.ТекущиеДанные.Сотрудник);	
			КонецЕсли;
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата окончания отпуска меньше даты начала'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диаграмма(Команда)
	АдресДиаграммВХранилище = ПоместитьОтпускаВоВременноеХранилище(); 
	ПараметрыДиаграммы = Новый Структура("АдресДиаграммВХранилище", АдресДиаграммВХранилище);
	ОткрытьФорму("ОбщаяФорма.ФормаГанта",ПараметрыДиаграммы, ЭтаФорма);
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнениеРезультатаДат(Сотрудник) 
	НайденныеСтроки = Объект.ГрафикОтпусков.НайтиСтроки(Новый Структура("Сотрудник",Сотрудник));
	РазностьДат = 0; 
	Для Каждого Строка Из НайденныеСтроки Цикл
		РазностьДат = РазностьДат + Число(НачалоДня(Строка.ДатаКонца) -НачалоДня(Строка.ДатаНачала))/(60*60*24);
		Строка.РазностьДат = РазностьДат;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПоместитьОтпускаВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ГрафикОтпусков.Выгрузить( ,"Сотрудник,ДатаНачала,ДатаКонца"));
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ВКМ_Отпуска") И Не РольДоступна("АдминистраторСистемы") Тогда
		Элементы.Диаграмма.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти










