
#Область ПрограммныйИнтерфейс
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоГода(Дата);
		Движение.БазовыйПериодКонец = КонецГода(Дата);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоГода(Дата);
		Движение.БазовыйПериодКонец = КонецГода(Дата);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать();

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Массив, &Массив, , Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
    Запрос.УстановитьПараметр("Массив", МассивИзмерений); 
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(Константы.НДФЛ.Получить()) Тогда
		НДФЛ = Константы.НДФЛ.Получить()/100;
	Иначе
		НДФЛ = 1;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого Запись Из Движения.ВКМ_Удержания  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("НомерСтроки",Запись.НомерСтроки));                                                    
		Запись.Результат = Выборка.РезультатБаза * НДФЛ;
	КонецЦикла;  
	Движения.ВКМ_Удержания.Записать(,Истина); 	
	
КонецПроцедуры

#КонецОбласти

