
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержанияСотрудникам Из УдержанияСотрудникам Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Штраф;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаУдержанияСотрудникам.Сотрудник;
		Движение.Результат = ТекСтрокаУдержанияСотрудникам.СуммаУдержания;
	КонецЦикла;
    Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры
