
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
	Движение.Период = НачалоМесяца(Дата);
	Движение.Сотрудник = Сотрудник;
	Движение.Оклад = Оклад;
	Если УстановитьПроцентОтРабот Тогда 
		Движение.ПроцентОтРабот = ПроцентПремии;
		Движение.ЗаполненностьРеквизита = Истина;
	Иначе 
		Движение.ЗаполненностьРеквизита = Ложь;
	КонецЕсли;	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
