
#Область ПрограммныйИнтерфейс
Процедура ОбработкаПроведения(Отказ, Режим)
	// 1. Запись плановых сведений в регистр 
	ФормирванияДвижений();
	// 2. Чтение данных из виртуальных таблиц
	ЧтениеДанных();
	ВзаиморасчетыССотрудником();
	РасчетОтгуленногоОтпуска();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ФормирванияДвижений()
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаОсновныеНачисления.ДатаКонца);
		Движение.БазовыйПериодНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаОсновныеНачисления.ДатаКонца);
		Движение.ПериодРегистрации = Дата; 
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник; 
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.БазовыйПериодНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаОсновныеНачисления.ДатаКонца);
		Движение.ПериодРегистрации = Дата; 
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник; 
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать(); 

КонецПроцедуры

Процедура ЧтениеДанных()
	
	Если ЗначениеЗаполнено(Константы.НДФЛ.Получить()) Тогда
		НДФЛ = Константы.НДФЛ.Получить()/100;
	Иначе
		НДФЛ = 1;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноЧасов,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодРегистрации, 0) КАК РабочихЧасов
	|ПОМЕСТИТЬ ВТ_ДанныеГрафика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеГрафика.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеГрафика.РабочихЧасов КАК РабочихЧасов,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ПериодРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВременнаяТаблица.РабочихЧасов КАК РабочихЧасов,
	|	ВременнаяТаблица.Оклад КАК Оклад,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход, 0) КАК СуммаКОплатеПриход
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&Начало, &Конец, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	|			ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник
	|		ПО ВременнаяТаблица.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка); 
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(ПериодРегистрации)); 
	Запрос.УстановитьПараметр("Конец", КонецМесяца(ПериодРегистрации)); 
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("НомерСтроки",Запись.НомерСтроки));
		Если Выборка.РабочихЧасов = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не заполнен график работы'");
			Сообщение.Сообщить();
			Запись.Результат = 0;
		ИначеЕсли Выборка.Оклад = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Не заполнен оклад сотрудника: ""%1"".'"),Выборка.Сотрудник);
			Сообщение.Сообщить();
			Запись.Результат = 0;
		Иначе 
			Запись.Результат = Выборка.Оклад /Выборка.РабочихЧасов * Выборка.ОтработаноЧасов + Выборка.СуммаКОплатеПриход;
		КонецЕсли;
		
		Запись.РабочихЧасов = Выборка.РабочихЧасов;
		Запись.ОтработаноЧасов = Выборка.ОтработаноЧасов; 
		Запись.СуммаПремии = Выборка.СуммаКОплатеПриход;
	КонецЦикла;  
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина); 
	
	//ФормируемНДФЛпроводки	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&МассивИзмерений, &МассивИзмерений, , Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("МассивИзмерений", МассивИзмерений);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Для Каждого Запись Из Движения.ВКМ_Удержания  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("НомерСтроки",Запись.НомерСтроки));                                                    
		Запись.Результат = Выборка.РезультатБаза * НДФЛ;
	КонецЦикла; 
	Движения.ВКМ_Удержания.Записать(,Истина);
	 
КонецПроцедуры

Процедура ВзаиморасчетыССотрудником()
	
	ВКМ_ДляРахработки.ВзаимоРасчетыСотрудников(ЭтотОбъект,Дата);	
	
КонецПроцедуры

Процедура РасчетОтгуленногоОтпуска()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.ВКМ_ДвиженияПоОтпускам.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия) КАК ОтгуленныйОтпуск
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|ГДЕ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета
		|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &НАЧАЛО И &КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("КОНЕЦ", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НАЧАЛО", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ДвиженияПоОтпускам.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Регистратор = ЭтотОбъект;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ОтпускДней = ВыборкаДетальныеЗаписи.ОтгуленныйОтпуск/8;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

#КонецОбласти