
#Область ПрограммныйИнтерфейс
Процедура ОбработкаПроведения(Отказ, Режим)
	// 1. Запись плановых сведений в регистр 
	ФормирванияДвижений();
	// 2. Чтение данных из виртуальных таблиц
	ЧтениеДанных();
	ВзаиморасчетыССотрудником();
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Процедура ФормирванияДвижений()
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаОсновныеНачисления.ДатаКонца);
		Движение.ПериодРегистрации = Дата; 
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник; 
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры


Процедура ЧтениеДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ОтработаноЧасов,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодРегистрации, 0) КАК РабочихЧасов
	|ПОМЕСТИТЬ ВТ_ДанныеГрафика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеГрафика.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеГрафика.РабочихЧасов КАК РабочихЧасов,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ПериодРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВременнаяТаблица.РабочихЧасов КАК РабочихЧасов,
	|	ВременнаяТаблица.Оклад КАК Оклад,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход, 0) КАК СуммаКОплатеПриход
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&Начало, &Конец, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	|			ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник
	|		ПО ВременнаяТаблица.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка); 
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(ПериодРегистрации)); 
	Запрос.УстановитьПараметр("Конец", КонецМесяца(ПериодРегистрации)); 
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	НДФЛ = 0.87;
	Выборка = РезультатЗапроса.Выбрать();
	Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления  Цикл
		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура ("НомерСтроки",Запись.НомерСтроки));
		Если Выборка.РабочихЧасов = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не заполнен график работы'");
			Сообщение.Сообщить();
			Запись.Результат = 0;
		Иначе                                                     
			Запись.Результат = (Выборка.Оклад /Выборка.РабочихЧасов * Выборка.ОтработаноЧасов + Выборка.СуммаКОплатеПриход) * НДФЛ;
			
		КонецЕсли;
			Запись.РабочихЧасов = Выборка.РабочихЧасов;
			Запись.ОтгуленныйОтпуск = (Выборка.РабочихЧасов - Выборка.ОтработаноЧасов)/8;
			Запись.ОтработаноЧасов = Выборка.ОтработаноЧасов; 
			Запись.Размер = Выборка.Оклад;
			Запись.СуммаПремии = Выборка.СуммаКОплатеПриход;
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
КонецПроцедуры

Процедура ВзаиморасчетыССотрудником()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК ОсновныеНачисления,
		|	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0) КАК Премия,
		|	ЕСТЬNULL(ВКМ_Удержания.Результат, 0) КАК Удержания,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета
		|	И ВКМ_ОсновныеНачисления.ПериодДействияНачало >= &ПериодДействияНачало
		|	И ВКМ_ОсновныеНачисления.ПериодДействияКонец <= &ПериодДействияКонец";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ПериодДействияНачало",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ПериодДействияКонец",КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = Выборка.Сотрудник; 
			Движение.Сумма = Выборка.ОсновныеНачисления + Выборка.Премия -Выборка.Удержания;
	КонецЦикла;
			
КонецПроцедуры
#КонецОбласти