 
 #Область ПрограммныйИнтерфейс
 
 Функция ОбработкаВходящихЗапросов(Запрос) Экспорт
	Секрет = Запрос.ПараметрыURL.Получить("secret");
	
	Если Секрет <> Константы.ВКМ_СекретТелеграмм.Получить() Тогда
		Ответ = ВКМ_ОбщегоНазначенияHTTP.ПростойОтрицательныйОтвет();
		Возврат ВКМ_ОбщегоНазначенияHTTP.ОтветJSON(Ответ,403);	
	КонецЕсли; 
	 ДанныеЗапроса = ДанныеЗапроса(Запрос); 	
	 Если ДанныеЗапроса.Свойство("message") Тогда
		 Возврат ОбработатьСообщение(ДанныеЗапроса.message);
	 КонецЕсли;
	 
	 Возврат ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
	 
 КонецФункции
 
 #КонецОбласти
 
 
 
 #Область СлужебныеПроцедурыИФункции
 
 Функция ОбработатьСообщение(Данные)
	 
	 Если Данные.Свойство("from") Тогда
		 ЗафиксироватьОтправителя(Данные.from); 
	 КонецЕсли;
	 
	 //ИдентификаторЧата = Данные.chat.id;
	 ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппы.Получить();
	 Если Данные.Свойство("text") Тогда
	 	ТекстСообщения = Данные.text;
	Иначе 
		ТекстСообщения = "Пустое сообщение";
	КонецЕсли; 
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method", "sendMessage");  
	ДанныеОтвета.Вставить("chat_id", ИдентификаторЧата);
	ДанныеОтвета.Вставить("text", ТекстСообщения);
	Возврат ВКМ_ОбщегоНазначенияHTTP.ОтветJSON(ДанныеОтвета); 
	 
 КонецФункции
 
 Функция ДанныеЗапроса(Запрос)
	 ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	 Возврат ВКМ_ОбщегоНазначенияHTTP.ОбъектJSON(ТелоЗапроса);
 КонецФункции
 
 Процедура ЗафиксироватьОтправителя(Данные)
	 
	 Идентификатор = Данные.id;
	 Ссылка = Данные.username;
	 УчетнаяЗапись = Справочники.ВКМ_УчетныеЗапиписиТелеграмма.НайтиПоКоду(Идентификатор);
	 
	 Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		 Возврат;	 		 
	 КонецЕсли; 
	 
	 ЧастиИмениПользователя = Новый Массив; 

	 
	 Если Данные.Свойство("first_name") Тогда
		 ЧастиИмениПользователя.Добавить(Данные.first_name);
	 КонецЕсли; 
	 
	 Если Данные.Свойство("last_name") Тогда
		 ЧастиИмениПользователя.Добавить(Данные.last_name);
	 КонецЕсли;
	 
	 ИмяПользователя = СтрСоединить(ЧастиИмениПользователя, " ");
	 
	 СпрОбъект = Справочники.ВКМ_УчетныеЗапиписиТелеграмма.СоздатьЭлемент();
	 СпрОбъект.Наименование = ИмяПользователя;
	 СпрОбъект.Код = Идентификатор; 
	 СпрОбъект.СсылкаНаТелеграмм = СтрШаблон("https://t.me/%1",Данные.username);
	 СпрОбъект.Записать();
	 
 КонецПроцедуры
 

 #КонецОбласти