#Область ОбработчикСобытийЭлементовШапкиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВидимостьРеквизитовЗаказа(Истина);
	Иначе
		ВидимостьРеквизитовЗаказа(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВидимостьРеквизитовЗаказа(Истина);
	Иначе
		ВидимостьРеквизитовЗаказа(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_НачалоДействияПриИзменении(Элемент)
	Объект.ВКМ_КонецДействия = ДобавитьМесяц(Объект.ВКМ_НачалоДействия,12); 
КонецПроцедуры
#КонецОбласти

#Область ДополнительныеПроцедурыИФункции
&НаСервере
Процедура ВидимостьРеквизитовЗаказа(Значение)
	Элементы.ВКМ_НачалоДействия.Видимость = Значение;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Значение;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Значение; 
	Элементы.ВКМ_КонецДействия.Видимость = Значение;
КонецПроцедуры



#КонецОбласти