

&НаКлиенте
Процедура ОтразитьДолгПередСотрудником(Команда)
	ОтразитьДолгПередСотрудникомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьДолгПередСотрудникомНаСервере()
	Объект.Выплаты.Очистить();
	Объект.ВыплатыПлановые.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&Начало, &Конец, , , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Начало",НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Конец",КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток <> 0 Тогда
			НовСтр = Объект.Выплаты.Добавить();
			НовСтр.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтр.Сумма = -ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
			НовСтрВып = Объект.ВыплатыПлановые.Добавить();
			НовСтрВып.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтрВып.Сумма = -ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
     	КонецЕсли;
	КонецЦикла;
КонецПроцедуры
