

&НаКлиенте
Процедура ОтразитьДолгПередСотрудником(Команда)
	ОтразитьДолгПередСотрудникомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьДолгПередСотрудникомНаСервере()
	Объект.Выплаты.Очистить();
	Объект.ВыплатыПлановые.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаОстаток <> 0 Тогда
			НовСтр = Объект.Выплаты.Добавить();
			НовСтр.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтр.Сумма = -ВыборкаДетальныеЗаписи.СуммаОстаток;
			НовСтрВып = Объект.ВыплатыПлановые.Добавить();
			НовСтрВып.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НовСтрВып.Сумма = -ВыборкаДетальныеЗаписи.СуммаОстаток;
     	КонецЕсли;
	КонецЦикла;
КонецПроцедуры
