#Область ПрограммныйИнтерфейс 

Процедура ВКМ_ОбновлениеСекрьюритиКода() Экспорт
	
	ПараметрыПодключения = ПараметрыПодключения();
	Соединение = НовоеСоединение(ПараметрыПодключения);	
	Заголовки = ЗаголовкиДляЗапроса(); 
	АдресУстановкиСекурногоКода = ПараметрыПодключения.АдресУстановкиСекурногоКода;
	Запрос = Новый HTTPЗапрос(АдресУстановкиСекурногоКода,Заголовки);
	Ответ = Соединение.Получить(Запрос);
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();	
	Если Ответ.КодСостояния = 200 Тогда
		ЗаписьЖурналаРегистрации("Обновление секьюрного кода для телеграмма прошло успешно",
		УровеньЖурналаРегистрации.Информация,
		,,СтрокаОтвета);
	Иначе
		ВызватьИсключение "Ошибка регламентных заданий" ; 
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ВКМ_ОбщегоНазначенияHTTP.ОбработатьИнформациюОбОшибкеWebСервиса(СтрокаОтвета,
		ИнфоОбОшибке,,
		"Секурити код для телеграмма", 
		"Общий модуль.ВКМ_ОбновлениеСекрьюритиКода");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции  

Функция ПараметрыПодключения() 
	
		
	Результат = Новый Структура;
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБота.Получить(); 
	БелыйIPПубликацииРесурса = Константы.ВКМ_БелыйIP.Получить();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	СлучайноеЧисло = Формат(ГСЧ.СлучайноеЧисло(0,1000000),"ЧГ=0");
	
	Константы.ВКМ_СекретТелеграмм.Установить(СлучайноеЧисло);
	АдресУстановкиСекурногоКода = СтрШаблон("/bot%1/setWebhook?url=%2/%3",Токен,БелыйIPПубликацииРесурса,СлучайноеЧисло);
	
	Результат.Вставить("ЗащищённоеСоединение",Новый ЗащищенноеСоединениеOpenSSL);
	Результат.Вставить("АдресСервера", "api.telegram.org");
	Результат.Вставить("АдресУстановкиСекурногоКода",АдресУстановкиСекурногоКода);
	
	Возврат Результат;
	
КонецФункции

Функция НовоеСоединение(ПараметрыПодключения)
	Возврат Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,,,,,
	ПараметрыПодключения.ЗащищённоеСоединение);	
КонецФункции

Функция ЗаголовкиДляЗапроса()
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type",ВКМ_ОбщегоНазначенияHTTP.ТипКонтентаJSON());	
	Возврат Заголовки;
КонецФункции 


#КонецОбласти
