
Процедура ОчисткаРегистраСведений (Регистр)Экспорт
	
	Набор = Регистр.СоздатьНаборЗаписей();
	Набор.Записать();
	
КонецПроцедуры

Процедура ВзаимоРасчетыСотрудников(ДокументОбъект,Дата)Экспорт
	
  	
	Сотрудники = Новый ТаблицаЗначений;
	Сотрудники.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Сотрудники.Колонки.Добавить("Оклад",Новый ОписаниеТипов("Число"));
	Сотрудники.Колонки.Добавить("Премия",Новый ОписаниеТипов("Число"));
	Сотрудники.Колонки.Добавить("Удержания",Новый ОписаниеТипов("Число"));
	
	ДатаНачалаДействияРасчета = НачалоМесяца(Дата);
	ДатаКонцаДействияРасчета = КонецМесяца(КонецДня(Дата));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СУММА(ВКМ_ОсновныеНачисления.Результат), 0) КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации >= &НАЧАЛО
		|	И ВКМ_ОсновныеНачисления.ПериодРегистрации <= &КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("НАЧАЛО",ДатаНачалаДействияРасчета);
	Запрос.УстановитьПараметр("КОНЕЦ",ДатаКонцаДействияРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПолеДобавить = Сотрудники.Добавить();
		ПолеДобавить.Сотрудник = Выборка.Сотрудник;
		ПолеДобавить.Оклад     = Выборка.Результат;
		ПолеДобавить.Премия    = 0;
		ПолеДобавить.Удержания = 0;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СУММА(ВКМ_ДополнительныеНачисления.Результат), 0) КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.ПериодРегистрации >= &НАЧАЛО
		|	И ВКМ_ДополнительныеНачисления.ПериодРегистрации <= &КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("НАЧАЛО",ДатаНачалаДействияРасчета);
	Запрос.УстановитьПараметр("КОНЕЦ",ДатаКонцаДействияРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСотрудника = Сотрудники.Найти(Выборка.Сотрудник);
		Если СтрокаСотрудника <> Неопределено Тогда
			 СтрокаСотрудника.Премия = Выборка.Результат;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(СУММА(ВКМ_Удержания.Результат), 0)  КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.ПериодРегистрации >= &НАЧАЛО
		|	И ВКМ_Удержания.ПериодРегистрации <= &КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("НАЧАЛО",ДатаНачалаДействияРасчета);
	Запрос.УстановитьПараметр("КОНЕЦ",ДатаКонцаДействияРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСотрудника = Сотрудники.Найти(Выборка.Сотрудник);
		Если СтрокаСотрудника <> Неопределено Тогда
			 СтрокаСотрудника.Удержания = Выборка.Результат;
		КонецЕсли;
	КонецЦикла;
	
	ДвиженияВзаиморасчетов(ДокументОбъект,Дата,Сотрудники);
КонецПроцедуры

Процедура ДвиженияВзаиморасчетов(Документ,Дата,СотрудникиСписок)
	
	Документ.Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Если СотрудникиСписок.Количество() > 0 Тогда
		Для Каждого Строка Из СотрудникиСписок Цикл
			Если Строка.Оклад  <> Неопределено И Строка.Премия  <> Неопределено И Строка.Удержания  <> Неопределено Тогда
				Движение = Документ.Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Сотрудник = Строка.Сотрудник; 
				Движение.Сумма = Строка.Оклад + Строка.Премия -Строка.Удержания;	
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	

КонецПроцедуры